# Python dataframe을 SQL로 다루기
- 2가지 방법
- 1. pysqldf 라이브러리
- 2. pandasql 라이브러리
- 출처: http://databaser.net/moniwiki/wiki.php/DataFrame%EC%9D%84SQL%EB%A1%9C%EB%8B%A4%EB%A3%A8%EA%B8%B0

### 아래 주석 제거 후 설치 
+ 예제는 방법 1 기준

In [ ]:
# !pip install pysqldf  # 방법 1
# !pip install pandasql  # 방법 2

In [23]:
import pandas as pd
from pysqldf import SQLDF  # 방법 1
# from pandasql import sqldf  # 방법 2
import io

In [24]:
sqldf = SQLDF(globals())
# pysqldf = lambda q: sqldf(q, globals())  # 방법 2

In [33]:
txt1 = io.StringIO("""
id,nm
1,a
2,b
3,c
""")

In [34]:
txt2 = io.StringIO("""
id,age
1,20
2,30
3,40
""")

In [35]:
df1 = pd.read_csv(txt1)
df2 = pd.read_csv(txt2)

In [36]:
sqldf.execute("select * from df1 limit 3;")

   id nm
0   1  a
1   2  b
2   3  c

In [37]:
sqldf.execute("select * from df2 limit 3;")

   id  age
0   1   20
1   2   30
2   3   40

In [38]:
query = """
select
        t1.id
    , t1.nm
    , t2.age
from df1 t1
left join df2 t2
on t1.id = t2.id
"""

In [39]:
sqldf.execute(query)

   id nm  age
0   1  a   20
1   2  b   30
2   3  c   40